<a href="https://colab.research.google.com/github/julieisok/OurFisrtML/blob/master/2_%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84%EC%9D%98_%EB%B3%91%ED%95%A9.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 데이터 병합
 - concat()
 - merge()
 - 2개의 df를 합치는 방식

In [0]:
import numpy as np
import pandas as pd

In [3]:
# 데이터 준비 2개 
left = pd.DataFrame({ 
    'key':list('1234'), 
    'A':list('ABCD'), 
    'B':list('EFGH')
})

right = pd.DataFrame({ 
    'key':list('0123'), 
    'C':list('가나다라'), 
    'D':list('WXYZ')
})
print( left )
print( right )

  key  A  B
0   1  A  E
1   2  B  F
2   3  C  G
3   4  D  H
  key  C  D
0   0  가  W
1   1  나  X
2   2  다  Y
3   3  라  Z

### 합치기
 - 동일 컬럼을 기준으로 합친다
 - 교집합과 같은 맥락

In [4]:
pd.merge( left, right )

  key  A  B  C  D
0   1  A  E  나  X
1   2  B  F  다  Y
2   3  C  G  라  Z

In [5]:
pd.merge( left, right, on = 'key')

  key  A  B  C  D
0   1  A  E  나  X
1   2  B  F  다  Y
2   3  C  G  라  Z

In [6]:
# 오른쪽 데이터 프레임의 key컬럼 기준으로 데이터를 합친다
pd.merge( left, right, on = 'key', how='right')

  key    A    B  C  D
0   1    A    E  나  X
1   2    B    F  다  Y
2   3    C    G  라  Z
3   0  NaN  NaN  가  W

In [7]:
# 합집합 
pd.merge( left, right, on = 'key', how='outer')

  key    A    B    C    D
0   1    A    E    나    X
1   2    B    F    다    Y
2   3    C    G    라    Z
3   4    D    H  NaN  NaN
4   0  NaN  NaN    가    W

## concat

- 단순 합치기

In [8]:
# 상하로 단순하게 합쳤다 
pd.concat( [ left, right ], sort=True )

     A    B    C    D key
0    A    E  NaN  NaN   1
1    B    F  NaN  NaN   2
2    C    G  NaN  NaN   3
3    D    H  NaN  NaN   4
0  NaN  NaN    가    W   0
1  NaN  NaN    나    X   1
2  NaN  NaN    다    Y   2
3  NaN  NaN    라    Z   3

In [9]:
# axis = 1 : 수직방향으로 합친다 
# 공통의 컬럼이 없을때 사용 
pd.concat( [ left, right ], sort=True, axis = 1 )

  key  A  B key  C  D
0   1  A  E   0  가  W
1   2  B  F   1  나  X
2   3  C  G   2  다  Y
3   4  D  H   3  라  Z